text_mess = {
    'first_mess': "Привет, <b>{}</b>!\n\n"
                  "Добро пожаловать в бот для игры Тайный Санта.\n\n"
                  "Рад, что ты выбрал именно меня! Моя задача помочь тебе и твои друзьям провести игру честно и увлекательно.\n\n"
                  "Поскольку ты тут в первый раз, предлагаю пройти небольшое обучение ⬇️\n\n"
                  "Отличной игры 😉",
    'help_text': "Нужна помощь?\n"
                 "По всем вопросам: @alekatya",
    'rules_text': "Правила игры в Тайного Санту!🎅🏻\n\n"
                  "  1. Участники игры входят в игровую комнату и заполняют свой виш-лист\n"
                  "  2. Организатор игры нажимает кнопку Жеребьевка\n"
                  "  3. Каждый из игроков становится тайным Сантой. Игроку высылается виш-лист его подопечного\n"
                  "  4. Тайный Санта выбирает, покупает и запоковывает желаемый подарок из виш-листа подопечного\n"
                  "  5. В завимисоти от договоренности, высылаете по адресу или встречаетесь в назначенное время\n"
                  "  6. Дарите подготовленный подарок\n"
                  "  7. Получаете свой подарок от вашего тайного Санты\n\n"
                  "Хорошей игры!✨",

    'create_room_name': "Вы нажали на кнопку <b>Создать комнату</b>.\nВведите название комнаты или выберите из предложенных ⬇️\n\n<i>Совет: лучше всего называть комнату кратко, но понятно для всех участников игры. Например, ИСПк-302😉</i>",
    'create_room_name_error': "Название слишком длинное, попробуйте снова.",
    'create_room_cur': "Прекрасное название!\n\nСледующим шагом укажите валюту, в которой будет определен бюджет для подарков",
    'create_room_budget': "Установите бюджет на подарок.\nУкажите ваш лимит суммы или выберите из частых вариантов ⬇️",
    'create_room_budget_ins': "Бюджет {} успешно добавлен",
    'create_room_budget_error': "Пожалуйста, введите корректные данные.",
    'create_room_sending': "Как будет происходить процесс обмена подарками?\n\n<b>Отправка подарков почтой</b> подойдет для игры, участники которой находятся на расстоянии.\n\n<b>Встреча лично</b> подойдет для одноклассников, коллег или друзей, которые могут встреться в одном месте и обменяться подарками.\n\n<i>Примечание: если игрок не сможет встретиться в компании, он может указать это и адрес для отправки подарка, когда войдет в комнату</i>.",
    'create_room_done': "Данные вашей комнаты успешно сохранены! Код комнаты <code>{}</code>. Его нужно будет отправить, когда вы нажмете кнопку <b>Войти в комнату</b>. \nПерешлите данное сообщение остальным игрокам.\n\n<i>Ps. Если нажать на код – он сразу скопируется в буфер обмена</i>.",
    'create_room_meeting': "Вы выбрали <b>личную встречу</b>. Теперь укажите время и место встречи (в свободной форме).",

    'enter_new_room': "Вы нажали на кнопку <b>Войти в комнату</b>. Введите ключ комнаты, чтобы войти в нее.",
    'enter_room_doesnt_exists': "Данной комнаты не существует, проверьте ключ.",
    'enter_room_error': "Вы уже вошли в данную комнату. Чтобы просмотреть или изменить информацию, воспользуйтесь кнопкой меню <b>Мои комнаты</b>.",
    'enter_room_name': "Вы вошли в комнату <i>...</i>\nВведите свое имя.",
    'enter_room_name_error': "Имя слишком длинное, попробуйте снова.",
    'enter_room_post': "У вас назначена встреча с компанией для обмена подарками.\nЕсли не сможете присутсвовать на ней, выберите кнопку меню <b>Почта</b>.",
    'enter_room_sending': "Введите адрес и ФИО для отправки подарка по почте.",
    'enter_room_done': "Ваши данные в комнате были успешно сохранены!",

    'loc_w_new': "Похоже, ваш список подарков пуст.\nДобавьте новый подарок в виш-лист:",
    'loc_w_add': "Теперь необходимо выбрать желаемый подарок 🎁\nУчтите, что подарок должен укладываться в установленный бюджет <i>...</i>. ",
    'loc_w_add_2': "Добавьте желаемый подарок 🎁",
    'loc_w_ins': "Подарок {} был успешно добавлен в виш-лист\n\nХотите добавить еще один?",
    'wish': "🎁 Подарок: {}\n📝 Описание: {}",
    'wish_description': "Хороший выбор!\nТеперь, добавьте описание.",
    'wish_name': "Добавить новый подарок",
    'wish_ins': "🎁 Подарок: {}\n📝 Описание: {}\nбыли успешно добавлены в ваш виш-лист!\nЖелаете добавить еще подарков?",
    'global_wl': "Вы нажали на кнопку <b>Виш-лист</b>.\nДобавьте желаемые подарки.\n<i>Совет: Вы можете использовать разные подарки для разных комнат, все подарки храняться здесь для простого использования.</i>",
    'empty_wl': 'Ваш виш-лист пуст. Заполните его новыми подарками',

    'user_room': "Вы состоите в следующих комнатах:",
    'user_room_error': "Вы не состоите ни в одной комнате. Можете создать свою комнату самостоятельно или войти в уже существующую с помощью кнопки <b>Войти в комнату</b>.",
    'user_room_post': "Подарки отправляются почтой.",
    'user_wl': "Ваш виш-лист:",
    'user_loc_w': "Ваш список желаемых подарков в комнате:",
    'user_room_participant': "Имя игрока: {}\n"
                             "Ключ комнаты: <code>{}</code>\n"
                             "Имя комнаты: {}\n"
                             "Бюджет: {}\n"
                             "Адрес для получения подарка: {}\n",
    'user_room_organizer': "Ключ комнаты: <code>{}</code>\n"
                           "Имя комнаты: {} \n"
                           "Бюджет: {}\n"
                           "Место встречи: {}\n",
    'room_players': "Список участников игры:",
    'room_players_doesnt_exists': "В игру еще никто не вступил",
    'toss_up_result': "Результат жеребьевки",
    'toss_up': "Жеребьевка проведена!",

    'edit_select': "Что вы хотите изменить?",
    'edit': "Запишите новое значение.",
    'edit_done': "Отлично! Изменения внесены.",
    'edit_room_cur': "Укажите новую валюту, в которой будет определен бюджет для подарков",

    'edit_room_bud': "Укажите новую сумму буджета на подарок",

    'dont_understand': "Я вас не понимаю. ",
    'back_to_manu': "Вы вернулись в меню. ",

}


def get_text():
    pass
